{
    "character": "pip",
    "storyline": "umbrella_racing",
    "stories": {
        "story1": {
            "pages": [
                {
                    "text": [
                        "Rain drummed against Pip's bedroom window as morning light filtered through the clouds. It was the third rainy day in a row in Greenleaf, and Pip was tired of trudging to school with soggy socks.",
                        "'Come on, sweetheart! You'll be late!' Pip's mum called from downstairs.",
                        "With a sigh, Pip grabbed the plain black umbrella from beside the window.",
                        "Just another ordinary rainy day in Greenleaf — or so Pip thought..."
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_1.jpg"
                },
                {
                    "text": [
                        "As Pip splashed down the garden path, something extraordinary caught his eye.",
                        "High above the rooftops, colorful shapes darted through the rain clouds.",
                        "Pip squinted through the downpour. Those weren't birds—they were children! Children riding umbrellas through the sky!"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_2.jpg"
                },
                {
                    "text": [
                        "'Did you see that?' Pip gasped, turning to a nearby grown-up.",
                        "But the woman just hurried past, pulling her coat tighter",
                        "Pip watched in amazement as the flying children swooped and soared, their umbrellas gliding on air currents.",
                        "One boy with a red-striped umbrella performed a perfect loop-de-loop before zooming toward the school."
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_3.jpg"
                },
                {
                    "text": [
                        "All day, Pip couldn't stop thinking about the flying umbrellas.",
                        "When the final bell rang, Pip dashed straight home to the attic where Grandma kept her old things",
                        "Behind an old wardrobe, Pip spotted something unusual—a faded umbrella with racing stripes.",
                        "The handle was worn smooth, and one of the spokes was slightly bent, but Pip felt drawn to it immediately."
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_4.jpg"
                },
                {
                    "text": [
                        "'Hello there!'",
                        "Pip jumped and spun around. Perched on the window ledge was a beatiful blue bird, its feathers glowing light blue.",
                        "'Did... did you just talk?' Pip whispered.",
                        "The bird tilted its head.",
                        "'I'm Blu, and you've found quite the treasure! That's a racing umbrella - your grandparent's, I'd guess...'",
                        "'Racing umbrella?' Pip examined the worn fabric. 'You mean like those children I saw flying?'"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_5.jpg"
                },
                {
                    "text": [
                        "Blu fluttered down beside Pip.",
                        "'Precisely! You've discovered the Flying Umbrella Racing League—the secret sport that only children can see.'",
                        "'Of course! The Annual Golden Droplet Race is happening next week. It's the biggest race of the year!'"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_6.jpg"
                },
                {
                    "text": [
                        "Pip's stomach filled with butterflies, feeling nervous.",
                        "'What if I crash? What if everyone laughs at me?'",
                        "'Blu's eyes twinkled.",
                        "'Everyone worries sometimes, and that's totally normal. Look at this.'",
                        "Blu tapped the umbrella handle, and a small dial appeared with numbers from one to ten.",
                        "'This is your worry meter. When you're feeling a little nervous, it might show a three. When you're really scared, it might go up to nine. Right now, you're at about a five.'"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_7.jpg"
                },
                {
                    "text": [
                        "'Do the other racers feel worried too?",
                        "'Oh my, yes!' Blu chuckled. 'Everyone worries, even the champions! Let me introduce you to some of them.'",
                        "That afternoon, Blu took Pip to the park where children were practicing with their umbrellas.",
                        "'That's Maya', Blu whispered about a tall girl with curly hair. 'Last year she was terrified about starting at Raindrop Academy. Now she's won three races!'",
                        "Nearby, a freckled boy was inspecting his umbrella. 'That's Theo. He was so worried about performing in the school concert that he nearly didn't participate. Now he does amazing stunts!'"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_8.jpg"
                },
                {
                    "text": [
                        "Pip felt better knowing others had worries too.",
                        "'Training begins tomorrow at Raindrop Academy. Seven o'clock sharp!', Blu announced.",
                        "'The Golden Droplet Race isn't about being the fastest. It's about finding your own special way of flying.'",
                        "As evening fell, Pip clutched the racing umbrella tightly with excitement. Tomorrow he'd begin training at the famous Raindrop Academy! But what would happen when it was time to actually leave the ground? Pip's hands began to sweat just thinking about it. Would he be able to fly at all, or would his worries keep his feet firmly planted when the moment of truth arrived?"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story1/page_9.jpg"
                }
                
            ]
        },
        "story2": {
            "pages": [
                {
                    "text": [
                        "Write here",
                        "Write here",
                        "Write here"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story2/page_1.jpg"
                },
                {
                    "text": [
                        "Write here",
                        "Write here",
                        "Write here"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story2/page_2.jpg"
                }
            ]
        },
        "story3": {
            "pages": [
                {
                    "text": [
                        "Write here",
                        "Write here",
                        "Write here"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story3/page_1.jpg"
                },
                {
                    "text": [
                        "Write here",
                        "Write here",
                        "Write here"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story3/page_2.jpg"
                }
            ]
        },
        "story4": {
            "pages": [
                {
                    "text": [
                        "Write here",
                        "Write here",
                        "Write here"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story4/page_1.jpg"
                },
                {
                    "text": [
                        "Write here",
                        "Write here",
                        "Write here"
                    ],
                    "image": "/assets/images/pip/chapter_1/umbrella_racing/story4/page_2.jpg"
                }
            ]
        }
    }
} 